ErrorChen/SensorArray/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SENSORARRAY_ADS1262=y
CONFIG_SENSORARRAY_FDC_MATRIX_DISCARD_SAMPLES=1
CONFIG_SENSORARRAY_FDC_FAST_SWEEP_MIN_COOLDOWN_MS=1000
CONFIG_SENSORARRAY_BLE_STATUS_NOTIFY_EVERY_N_FRAMES=20
CONFIG_SENSORARRAY_FDC_DEVICE_READ4_LOG_LEVEL=1
CONFIG_SENSORARRAY_LOG_FRAME_SUMMARY_EVERY_N_FRAMES=50
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_BT_ENABLED=y
CONFIG_BT_GATT_MAX_SR_PROFILES=3
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=24
CONFIG_BT_GATTC_ENABLE=n
CONFIG_BT_BLE_SMP_ENABLE=n
CONFIG_BT_ACL_CONNECTIONS=1
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=12
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_BOARD_I2C_FREQ_HZ=350000
CONFIG_SENSORARRAY_OPERATION_FDC_WITH_ADS_GAP=y
CONFIG_SENSORARRAY_TARGET_FPS=20
CONFIG_SENSORARRAY_DEFAULT_ACTIVE_ROWS=8
CONFIG_SENSORARRAY_FDC_READY_INTB_STRICT=y
CONFIG_SENSORARRAY_FDC_STALE_UNREAD_DRAIN=y
CONFIG_SENSORARRAY_FDC_BOOT_PROFILE_BALANCED_20FPS=y
CONFIG_SENSORARRAY_FDC_RUNTIME_PROFILE_BALANCED_20FPS=y
CONFIG_SENSORARRAY_OUTPUT_USB_TEXT=y
# CONFIG_SENSORARRAY_OUTPUT_WIFI_TEXT is not set
CONFIG_SENSORARRAY_OUTPUT_BLE_STATUS=y
CONFIG_SENSORARRAY_OUTPUT_BLE_CAP_TEXT=y
CONFIG_SENSORARRAY_CAP_DECIMALS=6
CONFIG_SENSORARRAY_FDC_TEXT_CAP_TOTAL_PF=y
CONFIG_SENSORARRAY_TRANSPORT_DEFAULT_MODE="rel"
CONFIG_SENSORARRAY_TRANSPORT_DEFAULT_STREAM="ser"
CONFIG_SENSORARRAY_LOG_PROFILE_NORMAL=y
CONFIG_SENSORARRAY_LOG_PERIOD_FRAMES=50
CONFIG_SENSORARRAY_LOG_SHORT_FIELDS=y
# CONFIG_SENSORARRAY_EXPERT_MODE is not set
